/*
 
  1. OC是在C的基础之上.
     a. 将C复杂的繁琐的恶心的语法封装的更为简单.
        
         #import 
         NSLog
         NSString
         .......
 
     b. 在C语言的基础之上新增了一小部分的面向对象的语法.
 
 
 
  2. 实现需求之一:
     要把大象放进冰箱应该怎么办?
 
      a. 打开冰箱门.
      b. 把大象放进去
      c. 把冰箱门关上.
 
 
      有没有更好的方式:
 
      找1个冰箱 自己开门 自己把大象拉进去 自己关门.
 
 
 
      买电脑的需求的实现方式
 
      1). 根据自己的需求和预算确定买的电脑型号的.
 
          10000  iOS开发.
 
 
      2). 在网上查找资料 确定型号.
 
          rMMP 9288
 
      3). 去到岗顶.
 
 
      4). 找到Apple专门店.
 
 
      5). 砍价 成交.
 
      6). 愉快的回家了.
 
 
     -----------
      有可能会出的问题. 就是被骗.........
 
 
     避免被骗得方式: 找1个电脑高手.
 
 
     买电脑的两种方式:
     1). 每1件事情都是我们亲自去做. 这样不好  你不是专业的 所以你无法取做到专业.\
 
         强调的是过程,强调的是步骤. 我是主角. 我是1个彻头彻尾的执行者
 
 
 
     2). 找1个电脑高手. 我只需要带钱 其他事情电脑高手帮助我做.
 
         强调的是: 电脑高手. 我就是1个扬眉吐气的指挥者.
 
 
    同1件事情我们有两种不同的解决思路.
 
    如果解决1件事情的时候,每1件事情都是我们亲自去一步步实现 那么这种解决问题的思路叫做面向过程的解决思路.
    如果解决1件事情的时候,自己不去亲自做,而是找1个专门做这件事情的人来帮助我们做.这样解决问题的思路我们就叫做面向对象的解决思路.
 
 
 
    面向过程与面向对象是解决同1个问题的不同的思路.
 
 
 3. 代码世界的面向过程与面向对象.
 
    1). 面向过程.
 
    在遇到1个需求的时候,实现这个需求的每1个步骤 都是自己写代码亲自的去一步步的实现. 这样的解决问题的方式我们就叫做面向过程的方式.
    
 
    2). 面向对象.
 
        在遇到1个需求的时候,不要亲自去实现 而是找1个专门做这件事情的人来帮助我们搞定. 这样的解决问题的方式就叫做面向对象的解决方式.
 
 
 4. 面向对象和面向过程优缺点分析.
 
     C语言是1门面向过程的语言. 有功能的概念 但是没有人的概念.
     OC语言是1门面向对象的语言.
 
 
     面向过程的解决问题的缺点: 后期的维护和修改不方便.
     面向对象的解决问题的优点: 后期的维护和修改十分方便.
 
 
     使用面向对象设计我们的程序,可以让我们的程序在后期的维护和修改当中更加的方便和快捷.
 
 
 
 
 5. 如何使用面向对象来设计程序呢?
 
 
    当你遇到1个需求的时候. 不要亲自去实现. 
    1). 先看看有没有现成的人是专门做这件事情的. 框架. 如果有直接使用
 
    2). 如果没有.就自己造出1个拥有这样的功能的人. 那么造出来的这个人可以多次使用的.
 
 
 
 
 
 
 
 
 */
#import <Foundation/Foundation.h>

int main(int argc, const char * argv[])
{
    int arr[] = {10,20,1023,103,20,430,504,6505,605,70,608,708,1};
    
    //找1专门排序的人. 喊他排序.
    
//    vkenvcie
//    vnievnieivneivienvienve
//    vneinvienvienvi
//    vneivnienv
//    venivneivn
//    venivneivnei
//    
//    venivnievnie
//    vebuvniev
//    vneivnienv
//    vebivneivneivn
    
    
    
    
    return 0;
}























