/*
 1. 什么时候使用数组.
 
    有多个类型相同的数据 并且数据的意义相同的时候  才使用数组来存储.
 
    人数: 84
    李凯: 17
    页码: 400
    学费: 200
 
 
    学习小组(4人).  90 99 98 97
 
 
 2. 关于数组,你必须要会的几种算法.

 
    1). 给你1个整型的数组,找出这个整型的数组中的最大值.
 
    2). 给你1个整型的数组,找出这个整型的数组中的最小值.
 
    3). 给你1个整型的数组,求这个整型的数组中的累加和.
 
    4). 给你1个整型的数组,求这个整型的数组中的平均值
 
    5). 判断1个数组中是否包含指定的元素.
        遍历数组中的每一个元素.每遍历出来1个元素 就判断这个元素是不是我们要找的那个元素.
        如果找到了就OK  如果全部的元素都不和要找的数相等 那么就是没有.
 
    6). 找出指定的元素在数组中第一次出现的下标. 如果没有这个元素就打印-1.
 
        遍历数组中的每一个元素,判断遍历出来的元素是不是和要找的数据相等.
        如果相等就打印出该元素的下标.
 
        如果全部的元素都不和要找的数相等 那么就是没有. -1
 
 
 
 
 
 
 
 
 
 */


#include <stdio.h>

int main(int argc, const char * argv[])
{
     
    
    //找指定的元素第1次出现的下标
    {
    /*
    int arr[] = {12,1,3,234,3,544,65,76,7,54,53,42,13,35,45,76,765,463521,3,35,76,6,8,8};
    int key = 176;
    
    int len = sizeof(arr) / sizeof(arr[0]);
    
    int flag = 0;
    for(int i = 0; i < len; i++)
    {
        if(arr[i] == key)
        {
            printf("找到啦 下标为:%d \n",i);
            flag = 1;
            break;
        }
    }
    
    
    if(flag == 0)
    {
        printf("没有找到 -1\n");
    }
    */
    }
    
    
    //判断数组中是否包含指定的元素.
    {
    /*
    int arr[] = {12,123,123,2,4,35,46,67,6,765,34,3,45,687,98,75645,32,454,6};
    int key = 98;
    int len = sizeof(arr)/sizeof(arr[0]);
    int flag = 0;//旗帜
    for(int i = 0; i < len; i++)
    {
        if(arr[i] == key)
        {
            printf("找到啦\n");
            flag = 1;
            break;
        }
    }
    //如果上面的循环是break结束.说明找到啦.
    //如果上面的循环是正常结束.没有找到.
    if(flag == 0)
    {
        printf("Sorry,没有找到!\n");
    }
    */
    }
    
    
    //求1个整型数组中的所有的元素的累加和与平均值
    {
    /*
    int arr[] = {12,1,21,32,14,35,4,65,64,342,23,434,54,53,4,34,54,64,6,567,5};
    //框变量.
    int sum = 0;
    int len = sizeof(arr)/sizeof(arr[0]);
    for(int i = 0; i < len; i++)
    {
        sum += arr[i];
    }
    printf("sum = %d\n",sum);
    printf("avg = %d\n",sum / len);
    */
    }
    
    //求1个整型数组中的最小值
    {
    /* 求1个整型数组中的最小值
    int arr[] = {10,21,2,1,332,5,46,57,56,64,324,323,21,43,456,45,42,4,3,4};
    
    int min = INT32_MAX;
    
    int len = sizeof(arr)/sizeof(arr[0]);
    
    for(int i = 0 ; i < len;i++)
    {
        if(arr[i] < min)
        {
            min = arr[i];
        }
    }
    
    printf("min = %d\n",min);
    */
    }
    
    
    // 找出整型数组中的最大值
    {
    /* 找出整型数组中的最大值
    int arr[] = {10,21,2,1,332,5,46,57,56,64,324,323,21,43,456,45,42,4,3,4};
    
    int max = INT32_MIN;
    
    int len = sizeof(arr)/sizeof(arr[0]);
    
    for(int i = 0 ; i < len;i++)
    {
        if(arr[i] > max)
        {
            max = arr[i];
        }
    }
    
    printf("max = %d\n",max);
    */
    }
    
    
    
    
    
    return 0;
}
