/*
 
  1. 到目前为止,我们学习了哪些运算符呢?
 
     =  赋值运算符
     + - *  / % 算术运算符
     += -= *= /= %= 复合赋值运算符
     ++ -- 自增自减运算符
     , 逗号运算符
     > >= < <= == !=  比较运算符.关系运算符.
     && || ! 逻辑运算符.
     & 取地址运算符.
 
     C语言中的表达式可以由多种运算符来共同参与.
 
 
  2. C语言将所有的运算符分为了15个等级.
     1级的优先级最高.
     15级的优先级最低.
 
     当表达式中有多种运算.先算优先级较高的,再算优先级较低的.
 
 
  3. 运算符的结合性.
 
     当1个表达式中的运算符的优先级是一样的时候. 是从左到右计算 还是从右到左计算,是根据运算符的结合方向来的.
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 */

#include <stdio.h>

int main(int argc, const char * argv[])
{

    
    int i = 1;
    int j = 2;
    int k = 3;
    
    i += j += k += 2;
    
    printf("i = %d\n",i);
    
    
    
//    i = j = k = 10;
    
    //printf("i = %d j = %d k = %d\n",i,j,k);
    
//
//    
//    int res =  i + k - j + i;
    //i > 3 < -5 && 3 > 2 < k;
    //0 < -5 && 3 > 2 < k;
    //0 && 1;
    //0
    
   //printf("res = %d\n",res);
    
    
    
    
    
    
    
    
    
    return 0;
}
