/*
 
 1. 我们在定义宏的时候,宏名是可以带参数的.
    在这个宏值当中.可以直接使用这个参数
 
 
 2. 如果使用的宏有参数,那么就必须要在使用它的时候为这个宏的参数传值.
 
 
 
 3. 宏代换的原理是什么?
 
    1). 先将传入的值传递给宏的参数,那么宏的参数的值就是我们传递的值.
 
    2). 再把宏值当中使用参数的地方换成参数的值.
 
    3). 最后,再将使用宏名的地方,替换为最后的宏值.
 
 
 4. 使用带参数几点注意
 
    1). 宏不是函数,所以宏的参数不需要加类型说明符. 直接写参数名就可以了.
 
    2). 我们在定义宏的时候,编译器是如何区分宏名和宏值.
 
        #define 空格 宏名  空格.
 
        第1个空格和第2个空格之间的内容会作为宏名
        第2个空格以后的内容会作为宏值.
 
        所以.在写宏的时候,空格要小心了.
 
    3). 为带参数的宏传值的时候,是本色传递.
 
 
        如果传递1个变量,并不是传递这个变的值
        而是直接传递的就是这个变量的串.
 
 
 
 5. 宏一定程度上可以实现和函数一样的效果.
 
    1). 宏值一旦换行,就任何宏定义结束了. 所以你打算使用宏去替换函数的话,那么些的很恶心.
 
    2). 只有当函数的代码很少的时候,只有几句的时候,就可以使用宏.
 
    3). 代码多的情况下,还是建议使用函数.
 
 
 
 
 
 
 
 
 
 
 */


#include <stdio.h>

#define N(a) a + a + a

#define SUM(a,b) a + b

#define MAX(a,b) a > b ? a : b

#define Q Q 10 + 10

#define SHOWLOGO printf("~~~~~~~~~~~~~~~~\n");printf("~~~~~~~~~~~~~~~~\n");printf("~~~~~~~~~~n");printf("~~~~~~~~~~~~~~~~\n");printf("~~~~~~~~~~~~~~~~\n");printf("~~~~~~~~~~~~~~~~\n");printf("~~~~~~~~~~~~~~~~\n");printf("~~~~~~~~~~~~~~~~\n");printf("~~~~~~~~~~~~~~~~\n");printf("~~~~~~~~~~~~~~~~\n");printf("~~~~~~~~~~~~~~~~\n");printf("~~~~~~~~~~~~~~~~\n");printf("~~~~~~~~~~~~~~~~\n");printf("~~~~~~~~~~~~~~~~\n")



int main(int argc, const char * argv[])
{
    
    
    int a =   2147483647;
    
    size_t
    
    
    //SHOWLOGO;
    
//    int c = 10;
//    int d = 20;
//    
//    
//    SUM(c, d);

    
    
    
//    int max = MAX(10,20);
//    
//    printf("max = %d\n",max);
//
    
//    int sum =  SUM(10,20);
//    
//    printf("sum = %d\n",sum);
    
    
//    
//    int b = N(10);
//    
//    printf("b = %d\n",b);
    
    
    
    
    
    return 0;
}
