/*

  1. scanf函数的使用.
    
     1). 作用.
 
     2). 语法格式.
 
     3). 使用正确的占位符.
         %d
         %f
         %lf
         %c
 
     4). 如何一次接收用户输入多个数据.
         前提: 只能是数.
 
     5). scanf函数的缓冲区.
 
         rewind(stdin);
 
 
   2. 交换两个变量的值.
 
      1). 声明第3方临时变量 转圈.
 
 
      2). 两数相加再相减.
 
 
   3. 算术运算符与算术表达式.
 
      1). 算术表达式的结果的类型.
 
 
      2). char
 
 
   4. 复合赋值运算符.
 
      int i = 10;
      i += 2; //i = i + 2;
 
 
 
   5. 自增与自减运算.
 
      ++
 
      自增表达式.
      int i = 1;
      前: ++i;
      后: i++;
 
 
   6. 逗号表达式.
 
 
 
 
   7. 比较运算符与比较表达式.
 
      > >= < <= == !=
 
        
      比较表达式: 条件.
 
    
      int i =  10 > 3;
 
 
 
 
 
 
 
 
 
 */

#include <stdio.h>

int main(int argc, const char * argv[])
{
    

    
    
    
    
    return 0;
}
