/*
  1. 什么是注释
     就是对代码的注解.解释代码是做什么事情的.方便我们以后查看代码.
     提高的阅读性.
 
  2. 单行注释
     // 后面的这1行的内容会被当做注释.
     注释的内容编译器是不会编译的.会直接忽略. 所以注释的内容是可以随便写的.
 
 
  3. 多行注释
     斜杠* 和 *斜杠 中间的内容无论有多少行,都会被作为注释.
 
 
  4. 快捷键
     选择需要注释或者取消注释的内容 Command + /
 
 
  5. 关于注释的规范
     
     1). 勤于写注释.
 
     2). 已经写好的代码不要删除 如果要换注释就可以.
 
 
 
 
 
 
 
 */
#include <stdio.h>

int main(int argc, const char * argv[])
{
    
    //这句话的功能可牛了.在打印1个HelloWorld
    
//    春天来了
//    万物复苏了
//    好天气啊
//    心情好
//   
    
printf("Hello, World1111!\n");
           printf("Hello, 22222!\n");

    //printf("Hello, 3333!\n");

                               printf("Hello, 444!\n");

 printf("Hello, 5555!\n");

    
    return 0;
}
