/*
  1. 顺序结构
 
     我们的代码从上到下的一句一句的逐句执行 
     每一句代码都要执行.
     像这样的代码结构,我们叫做顺序结构.
 
 
  2. 分支结构
 
     IF结构和switch-case结构就是我们的分支结构.
     它可以让我们的代码出现很多个分支.然后选择其中1个分支来执行.
 
     判断结构和选择结构.
 
 
  3. 循环结构
 
     同1段代码,反复不停的执行指定的次数.
     while、do-while、for就可以实现我们的循环结构.
 
     顺序结构和分支结构 都是从上到下的整体顺序,不会回去.
     循环结构.就会回去.
 
 
 
 
 
 
 */
#include <stdio.h>

int main(int argc, const char * argv[])
{

    printf("啦啦啦啦啦啦啦\n");
    printf("我是卖报的小行家\n");
    printf("不等天明去卖报\n");
    printf("呵呵呵呵\n");
    
    
    
    return 0;
}
