/*
 
 1. 遍历指定范围的数.
 
    请打印1-10之间的每1个整数.
 
    能使用循环吗?
 
    其实啊,这是1个循环10次的循环.
 
    所以,我们可以写1个循环10次的循环,在循环体直接使用循环增量的值.
    循环增量的值就是这个范围中的没1个数.
 
 
 
  2. 实现步骤. 
     遍历 n - m 之间的每1个整数.
 
     1). 先声明1个循环增i 默认值是n
 
     2). 循环条件写 i <= m
 
     3). 在循环体中 循环增量i的值就是n-m之间的每1个整数.
 
     4). 一定要记得在循环体后面自增循环增量.
 
     int i = n;
 
     while(i <= m)
     {
        i的值就是n -  m 之间的整数.
 
        i++;
     }
 
 
 
 
 
 */

#include <stdio.h>

int main(int argc, const char * argv[])
{
    
    
    int i = 10;
    while (i <= 100)
    {
        
        printf("%d\n",i);
        i++;
    }
    
    
    

//    int i = 1;
//    while (i <= 10)
//    {
//        printf("%d\n",i);
//        i++;
//    }
//    
    
    
    return 0;
}
