/*

 
 Day01
  1. OS X
  2. 终端的使用.
  3. C语言.
 
 Day02
  1. Xcode的使用
  2. 数据的处理.
  3. 程序的运行模式.
  4. 数据类型
  5. 变量.
  6. printf函数
 
 Day03-表达式
  1. scanf
  2. 算术表达式.
  3. 复合赋值运算符
  4. 自增和自减
  5. 逗号表达式
  6. 比较运算
 
 Day04 流程控制

  1. 逻辑运算
  2. IF结构
  3. 变量的作用域
  4. IF-ELSE
  5. IF_ELSEIF/. 
  6. 三元表达式
  7. 产生随机数
 
 Day05. 循环
  1. switch-case
  2. 程序的调试
  3. while循环
    
  4. 6种应用.
 
 Day06-循环
 
  1. 复习.
  2. do-while
  3. for
  4. 嵌套循环.
 
 
 Day07-函数
 
  1. 无参数无返回值的函数
  2. 带参数的函数
  3. return
  4. 带返回值的函数
  5. 函数的声明和实现
 
 
 Day08-进制
  1. 文本包含指令.
  2. 多文件开发
  3. 进制.
 
  比较少用.
 
 Day09-数组
 
  1. 数组的基本使用.
  2. 数组在内存中的存储.
  3. 数组与函数.
  4. 常用算法.
     排序.
     查找.
     翻转
 
  C语言的数组在后面几乎不会用.
 
 Day10-字符串
  1. 二维数组
  2. 字符串.
 
 
 C语言的字符串在后面几乎不会用.

 
 Day11-指针
 
  1. 
  使用
  p
  *p
 
  2. 指针的应用.
 
  3. 多级指针.
 
  4. 为什么要分类型.
 
  5.  + -
   
   6.
 
 
 Day12-指针
 
   1. 指针与字符串.
 
   2. 迷宫.
 
 
 
 一级指针指向结构体.
 
 
 Day13- 结构体枚举.
 
 
 Day14-
 
 
 
 */

#include <stdio.h>

int main(int argc, const char * argv[])
{
    // insert code here...
    printf("Hello, World!\n");
    return 0;
}
