/*
 1. do-while循环.
 
    1).作用. 循环.
    2).语法
       do
       {
         循环体;
       }while(循环条件);
    3).执行步骤.
    4).什么时候用.
 
 
 2. for循环.
 
    1). 作用: 循环
    2). 语法
        for(初始化表达式;循环条件表达式;循环后操作表达式)
        {
            循环体;
        }
    3). 执行步骤
 
    4). 与while
        a. 为最重要的三句代码设计了1个专门的位置.
        b. 三个表达式可以省略. 第2个省略就是死循环.
 
 
 3. 嵌套循环
     
    1). 会看
    2). 会写简单的.
 
    3). 特点: 
 
    4). 当在完成1件事情1次的同时 另外1件事情要完成N次.
 
        每完成1行的打印同时 就要完成N个表达式的打印.
 
 
 4. 代码结构.
 
    顺序结构
    分支结构. IF switch-case
    循环结构.
 
 
 
 
 */

#include <stdio.h>


int main(int argc, const char * argv[])
{
    

    
    return 0;
}
