/*
  1. Xcode文档的安装与使用.
 
 
  2. static关键字修饰方法中的局部变量.
 
 
  3. self关键字.
 
     1). 在对象方法中.
        
         父类的成员对于子类来讲,也是属于子类的.所以父类的成员在子类的方法中也可以使用self
 
     2). 在类方法中.
 
 
  4. 继承.
 
     1). 继承的目的:
 
     2). 继承的语法:
 
     3). 继承的效果:
 
     4). 继承是类在继承而不是对象在继承.
 
     5). 满足继承的关系.
         is a
     6). 继承的特点.

     7). NSObject类.
 
     8). 访问修饰符.
 
  5. 私有属性和私有方法.
 
 
  6. 里氏替换原则.
 
     1).什么是LSP
        Person *p1 = [Student new];
     2).为什么LSP是可以的.
 
     3).LSP的表现形式.  父类指针指向子类对象.
    
     4).LSP的好处.
 
     5).当1个父类指针指向1个子类对象的时候.只能通过这个父类指针访问这个对象中的父类成员.
 
 7. 方法重写
 
    1). 什么时候需要方法重写?
 
    2). 如何重写
 
    3). LSP的时候 通过指针调用的方法被子类重写了 那么调用的是子类重写的.
 
 
 8. 多态.
 
 
 
 
 
 
 */

#import <Foundation/Foundation.h>


int main(int argc, const char * argv[])
{
    
    
    
   

    
    
    return 0;
}
