/*
 1. switch-case结构. 选择结构.
    IF结构  判断结构.
 
 
    1). 语法.
    switch(表达式)
    {
        case 值1:
             执行代码;
             break;
        case 值2:
             执行代码;
             break;
        case 值3:
             执行代码;
             break;
         default:
             执行代码 ;
             break;
    }
 
    2).执行步骤.
 
 
 
    3).与if的区别
 
 
 2. 程序的调试.
 
    1).跟踪CPU执行代码的步骤.
 
 
    2).监视变量的值在程序执行的时候是如何变化的.
       BUG.
 
 
 
 3. 循环结构.
 
    1). 作用: 可以将同1段代码,反复不停的执行的指定的次数.
 
    2). while  do-while for
 
 
 4. while循环结构.
 
    1).作用:
 
    2).语法:
       while(条件表达式)
       {
            循环体;
       }
 
    3).执行步骤
       第1步骤: 先判断while后面的条件表达式的真假.
               1.1 如果为真,执行循环体,循环体执行完毕之后,跳回第1步骤继续执行.
               1.2 如果为假,结束循环.
 
    4).要当心死循环.
 
 
 5. 写循环的时候,要先确定.

    1). 循环体. 要被反复不停的执行的代码要写在循环体中,写在循环体中的代码就会被反复不停的执行指定的次数.
 
 
    2). 确定循环继续 或者 结束 的条件.
 
 
 
 6. 循环的六种应用场景.
 
 
 
 8. break与continue
 
    1). break
 
        用在循环体中,代表立即结束当前循环结构.
 
        循环结束的两种方式:
        a. 判断循环条件为假而结束.
        b. 在循环体内部使用break结束.
 
 
    2). continue
        用在循环体中,代表立即结束本次循环,立即回去判断循环条件.
 
 
 
 
 
 
 
 */

#include <stdio.h>

int main(int argc, const char * argv[])
{
    

    
    
    
    
    
    return 0;
}
