/*
 
  1. 循环体确定.循序的次数不确定的. 但是循环继续的条件是确定的.
 
     案例:
     让用户输入密码888888.如果输入错误,就重新输入.直到输入正确为止.
         
     循环体: 让用户输入密码并接收.
     循环次数: 不确定.
     循环继续的条件: 密码错误的时候,需要再循环1次.
 
 
  2. 实现步骤
 
     1). 先把循环的架子搭出来.因为我们确定是循环.
 
     2). 再把循环体写出来.
 
     3). 在循环条件中写上循环继续的条件.
         这个时候,你会发现循环条件要用到的变量声明在循环体中
         那么将这个变量声明在外面就可以.
 
  3. 课堂练习:
 
     反复询问用户,你爱我吗?y/n 只要回答的不是y 就再问 直到回答的是y为止.
     循环体: 问用户你爱我吗?并接收答案.
     循环次数:不确定.
     循环继续: 用户的回答不是y
 
 
 
  4. 注意
 
     参与循环条件表达式的变量的默认值.随意.
     但是不要赋值1个默认值.让第1次的循环判断就不成立.
 
     字符数据是要加单引号的.
 
 
  5. 课堂练习
 
     请用户输入登录账号和密码.123456 888888 只要1个不正确  就全部重新输入.直到正确位置.
     循环体: 输入并接收账号和密码
     循环次数:不确定
     循环继续: 账号不正确或者密码不正确.
 
 
 */

#include <stdio.h>

int main(int argc, const char * argv[])
{
    
    int zhangHao = 0 ,miMa = 0;

    while (zhangHao != 123456 || miMa != 888888)
    {
        printf("请输入账号: ");
        scanf("%d",&zhangHao);
        printf("请输入密码: ");
        scanf("%d",&miMa);
    }
    
    printf("恭喜你,登录成功!\n");
    
    
    
    
    
//    char ans = 'b';
//
//
//    while (ans != 'y')
//    {
//        printf("你爱吗? y/n \n");
//        rewind(stdin);
//      
//        scanf("%c",&ans);
//    }
//    printf("我也爱你.么么哒!\n");
    
    
//    int pwd = 0;
//    
//    while (pwd != 888888)
//    {
//        printf("请输入密码:");
//       
//        scanf("%d",&pwd);
//    }
//    
//    printf("输入正确\n");
    
    
    
    
    
//    int pwd = 0;
//    printf("请输入密码:");
//    scanf("%d",&pwd);
//    if(pwd == 888888)
//    {
//        printf("输入正确");
//    }
//    else
//    {
//        
//        printf("请输入密码:");
//        scanf("%d",&pwd);
//        if(pwd == 888888)
//        {
//            printf("输入正确");
//        }
//        else
//        {
//            printf("请输入密码:");
//            scanf("%d",&pwd);
//            if(pwd == 888888)
//            {
//                printf("输入正确");
//            }
//            else
//            {
//                
//            }
//
//        }
//        
//    }
    
    
    
    return 0;
}
