/*
  1. 自增运算符.
 
     ++
 
  2. 自增表达式.
 
     1).前自增表达式.
        int num = 1;
        ++num;
 
 
     2).后自增表达式.
        int num = 1;
        num++;
 
 
     3).无论是前自增表达式还是后自增表达式,都是将自身的值增加1.
 
 
  3. 自增表达式是1个表达式. 既然是1个表达式. 那么这个自增表达式就一定有1个结果.
     那么我们就可以使用1个变量把这个表达式的结果存储起来.
 
     后自增表达式的结果的计算方式:
     先将自身的值取出来作为后自增表达式的结果.然后再将自身的值+1
 
 
     前自增表达式的结果的计算方式:
     先将自身的值+1，然后再将自身的值取出来做为表达式的结果.
 
 
  4. 自增运算符的优先级比算术运算符的优先级要高.
 
     i++;
 
 
 
  5. 自减如是.
 
 
 
 */


#include <stdio.h>

int main(int argc, const char * argv[])
{
    
    int num = 1, j = 2;
    int k =  num++ + --j + j++ + --num;
    printf("k = %d\n",k);
    
    
    
//    int i = 1;
//    //--i;
//    
//    
//    i--;
//    printf("i = %d\n",i);
    
    
    
    
    
//    int i = 1;
//    
//    
//    int j =  i++ + ++i + i++ + ++i + i++;
//    //
//    printf("j = %d\n",j);
    
    
    
    
    
    
//    int i = 1;
//    int j = 2;
//    
//    int k = i++ + ++j + i++;
//    
//    printf("k = %d\n",k);
//    
    
    
    
    
    
    
    
//    int i = 1;
//    //int j = i++;//结果是1 结果算完以后,在讲i的值+1
//    
//    
//    int j = ++i;
//    
//    printf("i = %d\n",i);
//    printf("j = %d\n",j);
//    
    
    
    
    
   
    
    
    
    
//    int num = 1;
//    
//    //++num;
//    
////    int
//    
//    printf("num = %d\n",num);
    

    
    
    
    
    return 0;
}
