/*
  1. 对象作为类的属性.
     
     1). 类的属性代表什么?
         代表类所拥有的东西. 设计类的时候.我们怎么知道这个类有哪些属性呢?分析这类事物拥有什么东西.
         拥有的东西就可以作为这个类的属性.
 
         人有姓名、年龄、性别、身高、钱.
 
         空调类:品牌、颜色、大小、匹数.
 
 
     2). 类的方法代表什么?
         代表这类事物具有的行为.具有的功能.
         设计类的时候.我们如何知道这个类有哪些方法呢?
         那么就分析这类事物具有哪些行为，这个类事物具有哪些功能,会做什么?
 
         人: 走路 吃饭 睡觉 唱歌..
         空调: 制冷.制热.

  2. 有1个人类,还有1个狗类.
     人养了一条狗，人拥有1条狗.
     如何描述这个关系:人拥有1条狗.
 
     人拥有1条狗,那么就把狗作为人的1个属性.
 
 
  3. 对象完全可以作为另外1个类的属性.代表这个类拥有这个对象.
 
     A类拥有1个B对象,那么就将B对象作为A类的属性.
 
 
  4. 当A类作为B类的属性的时候. 在创建B类对象的时候, B类对象中的属性仅仅只是1个指针变量. 
     默认情况下并没有创建A对象.
 
 
  5. 重点:
     1). 什么时候1个类可以作为另外1个类的属性.
 
         吊扇:
         扇叶:
 
     2). 属性的本质其实是1个变量.
 
 
     3). 如何访问对象的属性对象的成员.
 
 
 
 
 
 
 
 */


#import <Foundation/Foundation.h>
#import "Person.h"


int main(int argc, const char * argv[])
{
    
    
    Person *p1 =  [Person new];
    
    p1->_dog = [Dog new];
    
    //为p1对象养的狗的姓名赋值.
    p1->_dog->_name = @"旺财";
    
    
    NSLog(@"p1->_dog->_name = %@",p1->_dog->_name);
    
    
    [p1->_dog shout];
    
    
    
    return 0;
}
