/*
 
  1. 计算机的三大件.
    
     CPU: 中央处理器 处理数据的. 负责计算. 协调其他硬件相互和谐的工作.

 
     内存: 存储数据的.临时存储数据.
           临时存储,存取数据的效率相对较高.
           电子式
 
 
     硬盘: 存储数据的.永久存储数据.
           永久存储 但是存取效率相对低下.
           机械式
 
 
  2. 程序是如何运行的.
     
     程序在运行之前是存储在硬盘之中的.
     当我们运行的程序的时候,CPU会将程序从硬盘中复制到内存中.
     CPU再读取内存中的程序代码
 
     WHY?
 
     因为内存中的数据读取效率更高.
 
 

 
 
 
 
 
 
 */
#include <stdio.h>

int main(int argc, const char * argv[])
{
    // insert code here...
    printf("Hello, World!\n");
    return 0;
}
