/*
  1. 不要惊恐、不要慌张.这玩意其实很简单.
     1个循环的循环体代码中又包括1个循环结构.
     就这样的 我们就叫做嵌套循环.
 
 
  2. 不要想太多. 只需要将里面的代码当做外面的循环的1个循环体就可以了,你管他什么代码.
     当外面的循环条件成立的时候.
     就要去执行循环体代码,不管什么代码反正就去执行.
 
 
  3. 第1个要求: 别人写1个嵌套,你可以看懂.并分析出执行结果.
 
     嵌套循环的特点: 外层循环循环1次. 内层循环要循环所有次.
 
 
  4. 第2个要求: 可以自己写一些简单的嵌套循环.
 
     我们在写代码的时候,什么情况下要写1个嵌套循环呢?
 
 
     嵌套循环的特点: 外层循环 循环1次 内层循环要循环所有次.
                 1件事情要完成1次. 另外1件事情就要完成所有次.
 
     
 
     地球是围绕着太阳在转的.每转1圈是1年. 公转.
 
     for(int i = 0; i < 3; i++)
     {
         printf("新的1年开始了.\n");
 
 
         printf("这的1年结束了.\n");
     }
 
 
     地球围绕着太阳转的同时,自己也在自转. 自转1圈是1天.
     当地球完成1次公转,就会完成365次自转.
 
     for(int i = 0; i < 365 * 3;i++)
     {
        printf("新的1天开始了\n");
        printf(这1天结束了\n);
     }
 
     地球公转1圈的同时,自己自转了365圈.
     公转这个事情要完成1次. 自转就必须要完成365次.
 
 
 
     什么时候要使用嵌套循环呢?
     A事情完成1次,B事情就必须要完成N次,那么这个时候就可以使用嵌套循环.
 
     外层循环是A的循环
     内存是B的循环.
 
 
 
  5. 课堂案例:
     要打印1个10行 每1行有10颗星的图案.
 
     **********
     **********
     **********
     **********
     **********
     **********
     **********
     **********
     **********
     **********
 
     有10行.
     每1行有10颗星.
 
     循环10次.每次循环完成1行的打印.
 
     而要完成1行的打印.就要在这1行打印10颗星.
     要完成1行的打印,就要完成10颗星的打印.
     要完成1行的打印 就要完成10颗星的打印.
 
 
  6. 课堂案例:
 
     *
     **
     ***
     ****
     *****
     ******
     *******
     ********
     *********
     **********
 
     一共有10行. 所以毫无疑问,我们应该写1个循环,循环10次. 每次打印1行.
     但是.每1行的星星不一样. 如果一样,就太简单啦啦啦啦啦啦啦啦啦啦.
     假设每1行都有10颗.
 
     第1行: 有1颗星
     第2行: 有两颗星
     第3行:  3
       4    4
       5    5
       6    6
       7    7
       8    8
       9    9
      10    10
       i    i
 
 
      i的值是多少 就表示内层循环是在打印第几行.
 
     for(int i = 1; i <= 10; i++)//外层循环循环1次,就要完成1行的打印.
     {
         for(int j = 0;j < 10; j++)
         {
            printf("*");
         }
         printf("\n");
     }
 
 
 
 
     *
     **
     ***
     ****
     *****
     ******
     *******
     ********
     *********
     **********
 
 
 
 
     *********
     ********
     *******
     ******
     *****
     ****
     ***
     **
     *
 
     有9行.
     第1行: 9  10
       2   8   10
       3   7   10
       4   6
       5   5
       6   4
       7   3
       8   2
       9   1
       i   ?
 
       i + ? = 10;
       ? = 10 - i;
       行数 + 星星  = 10;
 
       3 + x =  10;
       x = 10 - 3;
 
     所以,要打印这个倒三角形 就要写1个循环.循环9次.每次打印1行.
     for(int i = 1; i <= 9; i++)
     {
         for(int j = 0; j < 10 - i;j++)
         {
                printf("*");
         }
         printf("\n");
     }
 
 
 
 
 
 
 
 
         *
        **
       ***
      ****
     *****
    ******
   *******
  ********
 *********
**********
 
 
 有10行,所以毫无疑问,应该写1个循环 循环10次  每次打印1行.
 悲催的是,每1行的内容不一样.
 
 第1行: 9个空格 1颗星星.
 第2行: 8      2
   3   7       3
   4   6       4
   5   5       5
   6   4       6
   7   3       7
   8   2       8
   9   1       9
   10  0       10
   i   10-i    i
 
 
 每1行都有空格和星星.并且空格在前面,星星在后面.
 
 
 
 
 
 for(int i = 1; i <= 10; i++)//外层循环.循环1次就要打印1行.
 {
    for(int j = 0; j <10-i;j++)
    {
        printf(" ");
    }
    for(int k = 0; k < i; k++)
    {
        printf("*");
    }
    printf("\n");
 }
 
 
 
 
 
     
 
 
 
 
 
 
 */


#include <stdio.h>

int main(int argc, const char * argv[])
{
    
    for(int i = 1; i <= 10; i++)//外层循环.循环1次就要打印1行.
    {
        for(int j = 0; j <10-i;j++)
        {
            printf(" ");
        }
        for(int k = 0; k < i; k++)
        {
            printf("*");
        }
        printf("\n");
    }
    
    
    
    
//    for(int i = 1; i <= 10; i++)//外层循环循环1次,就要完成1行的打印.
//    {
//        for(int j = 0;j < i; j++)
//        {
//            printf("*");
//        }
//        printf("\n");
//    }
//    
//    
//    for(int i = 1; i <= 9; i++)
//    {
//        for(int j = 0; j < 10 - i;j++)
//        {
//            printf("*");
//        }
//        printf("\n");
//    }
//    
//    
    
//    for(int i = 0; i < 10; i++)//外层循环,外层循环 循环1次就要完成1行的打印.
//    {
//        //要完成1行的打印,就要打印10颗星 在这1行.
//        //而打印10颗星 最科学的方式 是使用循环.
//        for(int j = 0; j < 10; j++)
//        {
//            printf("*");
//        }
//        printf("\n");
//    }
    
    
//    for(int i = 0; i < 10; i++)
//    {
//        printf("\n");
//    }
//    
    
//    for(int i = 0; i < 3; i++) //循环1次 就代表地球公转了1圈.
//    {
//        printf("新的1年开始了.\n");
//        for(int j = 0; j < 365;j++)
//        {
//            printf("新的1天开始了\n");
//            printf("这1天结束了\n");
//        }
//        
//        printf("这的1年结束了.\n");
//    }
//    
    
   
    
    
    
//    for(int i = 0; i < 5; i++)
//    {
//        printf("===========\n");
//        for(int j = 0; j < 3; j++)
//        {
//            printf("我来了\n");
//        }
//        printf("===========\n");
//    }
    
//    int count = 0;
//    for(int i = 0; i < 10; i++)
//    {
//        printf("啦啦啦啦啦啦啦\n");
//        for(int j = 0; j < 10;j++)
//        {
//            count++;
//            printf("呵呵呵呵呵呵呵\n");
//        }
//        printf("黑诶嘿嘿和\n");
//    }
//    
//    printf("count = %d\n",count);
    
    
    return 0;
}
