/*
 
 1. 指针与指针之间可以做减法运算.
    结果是1个long类型的数据.
 
 
    结果的意义: 代表两个指针指向的变量之间相差多少个单位变量.
 
 
    绝大多数情况下. 我们用在判断数组的两个元素之间相差多少个元素.
 
 
    
 
 2. 如果参与减法运算的两个指针不指向同1个数组,结果就有问题.;
 
 
    两个指针变量的相减的结果:
 
    先求出两个指针的差 / 每1个指针变量对应的普通变量占用的字节数  ???
 
 
 
 3. 唯一的意义.
 
    就是用在数组中,判断两个元素之间相差多少个元素.
 
 
 
 
 4. 指针与指针之间只能做减法运算.
 
 
 
 
 
 
 */

#include <stdio.h>

int main()
{
    
    int num1 = 100;
    double num2 = 10.1;
    double num3 = 10.2;
    int num4 = 200;
    
    
    int *p1 = &num1;
    int *p2 = &num4;
    
    
    
    long res =  p2 - p1;
    
    printf("res = %ld\n",res);
    

//    int arr[] = {10,20,30,40,50,60,70,80,90,100};
//    
//    int* p1 = &arr[1]; //p1指向了数组的第0个元素.
//    
//    int* p2 = &arr[7];//p2指向了数组的最后1个元素 .
//    
//    
//    long res  = p2 - p1;
//    
//    
//    printf("res = %ld\n",res);
    
    
    
    
    
    
    
    
    
    
    
    return 0;
}
